hot_fire/app/controllers/tracks_controller.rb

  def index
    @tracks = Track.all
---
SELECT "tracks".* FROM "tracks"

  def create
    @track = Track.new(track_params)
    if @track.save
---
INSERT INTO "tracks" ("artist", "album", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["artist", "df"], ["album", "df"], ["created_at", "2019-06-06 20:33:56.987657"], ["updated_at", "2019-06-06 20:33:56.987657"], ["user_id", 1]]

  def update
    begin
     @track.update(track_params)
---
UPDATE "tracks" SET "song_title" = $1, "artist" = $2, "album" = $3, "user_id" = $4, "updated_at" = $5 WHERE "tracks"."id" = $6  [["song_title", "test"], ["artist", "test"], ["album", "test"], ["user_id", 2], ["updated_at", "2019-06-07 05:02:32.643573"], ["id", 14]]

  def destroy
    @track.destroy
---
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 9]]

  def set_track
    @track = Track.find(params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]