hot_fire/app/controllers/tracks_controller.rb

  def show
    @track = Track.find(params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]